src/Catalogs/рнсРазделыОбщихНастроек/рнсРазделыОбщихНастроек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рнсРазделыОбщихНастроек</name>
  <predefined>
    <items>
      <name>ЗаполнениеЗаявкиДС</name>
      <description>Заполнение заявки ДС</description>
    </items>
    <items>
      <name>ЗначенияПоУмолчанию</name>
      <description>Значения по умолчанию</description>
    </items>
    <items>
      <name>ОповещниеОбИзмненеиях</name>
      <description>Оповещние об измненеиях</description>
    </items>
  </predefined>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.рнсГруппыДоступаРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСекцииРаздела</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКлюча</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьКлючНастройки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения1</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения2</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения3</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения4</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения5</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФормыЗаполненияХранилища</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Секции</name>
    <attributes>
      <name>Секция</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвязиПараметровВыбора</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКДанным</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИзменениеЗначения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкаКлюча</name>
    <attributes>
      <name>ПолеКлюча</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
      </type>
    </attributes>
    <attributes>
      <name>Заголовок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/рнсРазделыОбщихНастроек/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий
	
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если НЕ (ЗначениеЗаполнено(ТипЗначения1) ИЛИ ЗначениеЗаполнено(ТипЗначения2) ИЛИ ЗначениеЗаполнено(ТипЗначения3) 
			ИЛИ ЗначениеЗаполнено(ТипЗначения4) ИЛИ ЗначениеЗаполнено(ТипЗначения5) 
				ИЛИ ЗначениеЗаполнено(ИмяФормыЗаполненияХранилища)) Тогда
				
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не определена полезная информация по разделу'"),,,, Отказ);
				
	КонецЕсли;	
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ)  
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли; 
	
КонецПроцедуры
	
#КонецОбласти  
	
#КонецЕсли
